rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
    int idx = 0;
    
    if(length > (0xFFFF >> 1) )
    {
        printf("ERROR: Buffer size must be smaller than 32K\n");
        return 0;
    }
    
    while(idx < length)
    {
        unsigned int val = data[idx].ivalue;

        NVMWriteWord(base_address + idx,  val);

        idx++;
    }
    
    return 1;
}


//int SaveIntFloatDataToFlashMemory(IntFloatValue *data, int length, unsigned int offset /* values */)
//{
//    unsigned int * base_address = (unsigned int *) BASE_DATA_ADDRESS_NVM + offset;
//   
//    int idx = 0;
//    
//    if(length > (0xFFFF >> 1) )
//    {
//        printf("ERROR: Buffer size must be smaller than 32K\n");
//        return 0;
//    }
//    
//    while(idx < length)
//    {
//        unsigned int val = data[idx].ivalue;
//
//        NVMWriteWord(base_address + idx,  val);
//
//        idx++;
//    }
//    
//    return 1;
//}

int LoadIntFloatDataFromFlashMemory(IntFloatValue *data, int length, unsigned int offset /* values */)
{
    unsigned int * base_address = (unsigned int *)BASE_DATA_ADDRESS_NVM + offset;
   
    int idx = 0;
    
    if(length > (0xFFFF>>1) )
    {
        printf("ERROR: Buffer size must be smaller than 32K\n");
        return 0;
    }
    
    while(idx < length)
    {
        data[idx].ivalue = *(base_address + idx);
        idx++;
    }
    
    return 1;
}



int LoadFloatDataFromFlashMemory(float *data, int length, unsigned int offset /* values */)
{
    unsigned int * base_address = (unsigned int *)BASE_DATA_ADDRESS_NVM + offset;
   
    int idx = 0;
    
    if(length * 2 > (0xFFFF>>1) )
    {
        printf("ERROR: Buffer size must be smaller than 32K\n");
        return 0;
    }
    
    while(idx < length)
    {
        int ipart = (int)*(base_address + 2*idx);
        int fpart = *(base_address + 2*idx + 1);
        
        if(ipart < 0)
        {
            data[idx] = (float)ipart - (float)fpart/1000.0;
        }
        else
        {
            data[idx] = (float)ipart + (float)fpart/1000.0;
        }
        
        idx++;
    }

    return 1;
}

void FloatToIntSplit(float data, int *int_part, int *float_part)
{
    int ipart = (int) data;
    int fpart = 0;
    
    if(ipart >= 0)
    {
        fpart = (int)((data - (float) ipart) * 1000.0); 
    }
    else
    {
        float d2 = -data;
        fpart = (int)((d2 - (float)((int) d2)) * 1000.0); 
    }
    
    *int_part = ipart;
    *float_part = fpart;
}

void ShowFloatData(float *data, int length)
{
    int i = 0;
    
    while(i < length)
    {
        int ipart;
        int fpart;
        
        FloatToIntSplit(data[i], &ipart, &fpart);
        
        printf("%d + %d/1000.0\n", ipart, fpart);
        i++;
    }
}


void WaitReadUART2()
{
    int val = 0;
    while(1)
    {
        
        if(DoReadUART2)
        {
            DoReadUART2 = FALSE;
            printf("UART2 RX Interrupt is called...\n");
            
        }
//        WAIT_AND_READ_FROM_UART2(val);
        while(U2STAbits.URXDA > 0)
        {
            val = U2RXREG;
        
            printf("Read data %d\n", val);
            WaitMS(1);
        }
    }
}


void __ISR( _UART_2_VECTOR, IPL3AUTO) _UART2RXInterrupt_(void)
{
    
    if(mU2RXGetIntFlag())
    {
    
        DoReadUART2  = TRUE;
    //    int val = U2RXREG;
    //    printf("Data Received...%c\n", (char) val);

//        int val =  U2RXRbits.U2RXR;
//        printf("UART 2 RX interrupt called....%d\n", val);


        mU2RXClearIntFlag();
    }
    else if(mU2TXGetIntFlag())
    {
        mU2TXClearIntFlag();
    }
    else if(mU2EGetIntFlag())
    {
        mU2EClearIntFlag();
    }
}


void *AllocateMaxPossibleMemory(uint32_t *data_length)
{
    void * buffer = NULL;
    
    while(*data_length > 0)
    {
        buffer = malloc((size_t) *data_length);
        
        if(buffer == NULL)
        {
            *data_length -= 1;
        }
        else
        {
            printf("%d KB (%d bytes) memory allocated\n", *data_length/1024, *data_length);
            return buffer;
        }
    }
    
    printf("Failed to allocate memory...\n");

    return NULL;
}


void GetCurrentTime(int *sec, int *ms)
{
    time_t tm;
    
//    tm = time(NULL);
    
    
}


void ReadSPI1Slave_test()
{
//    InitSPI1Slave();
    char str[100] = "Hello World\n";
    
    SpiChnEnable(SPI_CHANNEL1, 0);
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN|  SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_CKE_REV | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKE_REV | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_DISSDO | SPI_CONFIG_ON));

//    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_MSSEN | SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));

//    SpiChnSetBrg(SPI_CHANNEL2, brate);
    SpiChnEnable(SPI_CHANNEL1, 1);

    SPI1CONbits.ON = 1;

    int data = 0;
    int count = 0;
    while(1)
    {
        printf("%d: Reading  \n", count);
//        SpiChnPutC(SPI_CHANNEL1, 0xAA);
        data  = SpiChnGetC(SPI_CHANNEL1);
        
        int k=0; while(k++ < 1000);
        
        SpiChnPutC(SPI_CHANNEL1, 0b10111011); // 0b10111011 = 187
        
        printf("%d: %d\n", count, data);
        count++;
        count %= 256;
    }
    
}



void ReadSPI2Slave_test()
{
    
    SpiChnEnable(SPI_CHANNEL2, 0);
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN|  SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_CKE_REV | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKE_REV | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_DISSDO | SPI_CONFIG_ON));

