rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
//    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));

//    SpiChnSetBrg(SPI_CHANNEL2, brate);
    SpiChnEnable(SPI_CHANNEL2, 1);

    SPI2CONbits.ON = 1;

    WaitMS(1);
    
    int data = 0;
    int count = 0;
    while(1)
    {
        printf("%d: Reading...  ", count);
//        SpiChnPutC(SPI_CHANNEL1, 0xAA);
        data  = SpiChnGetC(SPI_CHANNEL2);
        
        int k=0; while(k++ < 1000);
  
        SpiChnPutC(SPI_CHANNEL2, data); // 0b10111011 = 187
//        SpiChnPutC(SPI_CHANNEL2, 0b10111011); // 0b10111011 = 187
        
        printf("rx %d\n", count, data);
        count++;
        count %= 256;
    }
    
}


void TestSPI1_Master()
{
    int data[2];
    
    
    while(1)
    {
        SpiChnPutC(SPI_CHANNEL1, 0);
        data[0] = SpiChnGetC(SPI_CHANNEL1);
        
        SpiChnPutC(SPI_CHANNEL1, 0);
        data[0] = SpiChnGetC(SPI_CHANNEL1);
        
        int32_t  value = ((data[0] << 8) | data[1]) & 0xFFFF;
        int32_t  vi = (value >> 2);
        
        printf("Value obtained %d, [%d, %d]\n", vi, (int)data[0], (int)data[1]);
        WaitMS(1);

    }
}


void Test_SPI2Slave_DataTransfer()
{
        int test_buffer_length = 15480;
        UInt16Value *test_buffer = NULL;
 
        test_buffer = (UInt16Value  *) AllocateMaxPossibleMemory(&test_buffer_length);

        if(test_buffer == NULL)
        {
            printf("ERROR: Cannot allocate memory \n");
            return;
        }
//        else
//        {
//            printf("Allocated memory size %d\n", test_buffer_length);
//        }
 
        int i =0;
        int count  = 0;
        
        for(i = 0; i < test_buffer_length/2; i++)
        {
            int uval = count &0xFF00;
            int lval = count & 0xFF;
            test_buffer[i].v.upper = 1;
            test_buffer[i].v.lower = 5;
            
        }
        
        int data_tx_count = 0;
        
        while(1)
        {        
        SpiChnEnable(SPI_CHANNEL2, 0);
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN|  SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_CKE_REV | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKE_REV | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_DISSDO | SPI_CONFIG_ON));

//    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
        SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));

//    SpiChnSetBrg(SPI_CHANNEL2, brate);
        SpiChnEnable(SPI_CHANNEL2, 1);

        SPI2CONbits.ON = 1;

        WaitMS(1);
        
        int vv;

//            if (test_buffer_length >= test_buffer_length)
//                continue;

            i = 0;

            printf("Data Transfer started\n");
        
            int is_first = 1;
            
            while(i < test_buffer_length/2)
            {
//                SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.upper);
                int val  = SpiChnGetC(SPI_CHANNEL2);
                if(is_first == 1)
                {
                    is_first = 0;
//                    mPORTASetBits(BIT_0 | BIT_1);
                }

                SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.upper);

//                vv = 0; while(vv++ < 100);

                val  = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.lower);
                
                test_buffer_length += 2;
                

//                vv = 0; while(vv++ < 100);

    //            printf("upper %d   lower %d\n", (int)test_buffer[i].v.upper, (int) test_buffer[i].v.lower);
                i++;
            }

            SpiChnClose(SPI_CHANNEL2);
//            mPORTAClearBits(BIT_0 | BIT_1);
            printf("Data Transfer finished\n");
        }
    
        free(test_buffer);
}




void Test_SPI2Slave_DataTransferWithUART2()
{
        int test_buffer_length = 1024*4;//15480;
        UInt16Value *test_buffer = NULL;
 
        test_buffer = (UInt16Value  *) AllocateMaxPossibleMemory(&test_buffer_length);

        if(test_buffer == NULL)
        {
            printf("ERROR: Cannot allocate memory \n");
            return;
        }
//        else
//        {
//            printf("Allocated memory size %d\n", test_buffer_length);
//        }
 
        
        SpiChnEnable(SPI_CHANNEL2, 0);
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN|  SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_CKE_REV | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKE_REV | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_DISSDO | SPI_CONFIG_ON));

//    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
        SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));

//    SpiChnSetBrg(SPI_CHANNEL2, brate);
        SpiChnEnable(SPI_CHANNEL2, 1);

        SPI2CONbits.ON = 1;

//        WaitMS(1);
        
        
//        TestUART2();
        
        printf("Waiting for UART command....,\n");
        
        char command[10];
        int command_length = 3;
        while(1)
        {
            int didx = 0;
            if(U2STAbits.URXDA)
            {
                while(U2STAbits.URXDA && didx < 10)
                {
                    command[didx] = UARTGetDataByte(1);
                    didx++;
                }
        
                printf("Main command received.... %d, %d, %d\n", (int)command[0], (int)command[1], (int)command[2] );
                
