rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
            }
            
            if(command[0] == 99)
            {
  
                command[0] = 0;
                command[1] = 0;
                command[2] = 0;

//                printf("command received.... %d, %d, %d\n", (int)command[0], (int)command[1], (int)command[2] );
                
                
//                if(command[0] != 99)
//                {
//                    continue;
//                }

                
//                printf("command received.... %d, %d, %d\n", (int)command[0], (int)command[1], (int)command[2] );
                int i =0;
                int count  = 0;

                for(i = 0; i < test_buffer_length/2; i++)
                {
                    int uval = count &0xFF00;
                    int lval = count & 0xFF;
                    test_buffer[i].v.upper = 1;
                    test_buffer[i].v.lower = 5;

                }

                UInt16Value dlen;

                dlen._value = test_buffer_length;
                
                printf("Buffer length to send %d\n", test_buffer_length);
                

                WRITE_TO_UART2(dlen.v.upper);
                WRITE_TO_UART2(dlen.v.lower);
                
                
                printf("Two bytes sent upper === %d,     lower === %d\n", dlen.v.upper, dlen.v.lower);
                
//                continue;
                
                int data_tx_count = 0;

                int vv;

        //            if (test_buffer_length >= test_buffer_length)
        //                continue;

                i = 0;

                printf("Data Transfer started\n");

                int is_first = 1;

                while(i < test_buffer_length/2)
                {
    //                SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.upper);
                    int val  = SpiChnGetC(SPI_CHANNEL2);
                    if(is_first == 1)
                    {
                        is_first = 0;
    //                    mPORTASetBits(BIT_0 | BIT_1);
                    }

                    SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.upper);

    //                vv = 0; while(vv++ < 100);

                    val  = SpiChnGetC(SPI_CHANNEL2);
                    SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.lower);

                    test_buffer_length += 2;


    //                vv = 0; while(vv++ < 100);

        //            printf("upper %d   lower %d\n", (int)test_buffer[i].v.upper, (int) test_buffer[i].v.lower);
                    i++;
                }

                printf("Data Transfer finished\n");

            }
        }

//        SpiChnClose(SPI_CHANNEL2);
//            mPORTAClearBits(BIT_0 | BIT_1);
        
        free(test_buffer);
}




void TestUART2()
{
    int count = 0;
    int tx = 50;

    printf("Reading UART2...\n");
    
    while(1)
    {
        if(U2STAbits.URXDA)
        {
            int val = (int) UARTGetDataByte(1); // UART2
            
            printf("%d:   UART2 read value %d\n", count++, val);

            printf("%d:   Writing to UART2 %d\n", (int) tx);
            
            WRITE_TO_UART2(tx);
            
            tx += 15;
            tx %= 256;
        }
    }
}